---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WorksharingFailures.MissingUpdaterLatestOrCentralSingular
source: html/916ad61d-658e-1cd9-9b99-e1791610957e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WorksharingFailures.MissingUpdaterLatestOrCentralSingular Property

The file [File Name] you are trying to synchronize was modified by the third-party updater [Updater Name(s)] which is not
 currently installed. \n\r \n\r If you continue to Synchronize with Central or Reload Latest, data maintained by this updater
 will not be updated properly. This may create problems when [File Name] is later opened when [Updater Name(s)] is present.

## Syntax (C#)
```csharp
public static FailureDefinitionId MissingUpdaterLatestOrCentralSingular { get; }
```